Bastion-RND/Watering-embedded/src/Slave-device/SVD/MM32F031xxq.svd
<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<device schemaVersion="1.1" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD_Schema_1_1.xsd">
	<name>MM32F031q</name>
	<version>1.01</version>
	<description>MM32F031q</description>
	<!--Bus Interface Properties-->
	<!--Cortex-M0 is byte addressable-->
	<cpu><name>CM0</name><revision>r0p0</revision><endian>little</endian><mpuPresent>false</mpuPresent><fpuPresent>false</fpuPresent>
		<nvicPrioBits>2</nvicPrioBits><vendorSystickConfig>false</vendorSystickConfig></cpu><addressUnitBits>8</addressUnitBits>
	<!--the maximum data bit width accessible within a single transfer-->
	<width>32</width>
	<!--Register Default Properties-->
	<size>0x20</size>
	<resetValue>0x0</resetValue>
	<resetMask>0xFFFFFFFF</resetMask>
	<peripherals>
		<peripheral>
			<name>ADC</name>
			<description>Analog to digital converter</description>
			<groupName>ADC</groupName>
			<baseAddress>0x40012400</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>ADC_COMP</name>
				<description>ADC and COMP global interrupt</description>
				<value>12</value>
			</interrupt>
			<registers>
				<register>
					<name>DR</name>
					<displayName>DR</displayName>
					<description>Data register</description>
					<addressOffset>0x00</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>VALID</name>
							<description>Valid flag</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OVERRUN</name>
							<description>Overrun flag</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CH</name>
							<description>ADC current channel convert data</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>DATA</name>
							<description>Transfer data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CFGR</name>
					<displayName>CFGR</displayName>
					<description>Configure register</description>
					<addressOffset>0x04</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>PREL</name>
							<description>ADC low prescaler coefficient</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SAMCTL</name>
							<description>Channel x Sample time selection</description>
							<bitOffset>10</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>RSLTCTL</name>
							<description>Resolution</description>
							<bitOffset>7</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>PREH</name>
							<description>ADC high prescaler coefficient</description>
							<bitOffset>4</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>VSEN</name>
							<description>Reference voltage enable</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TSEN</name>
							<description>Temperature sensor enable</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ADWEN</name>
							<description>ADC window comparison enable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ADEN</name>
							<description>ADC enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CR</name>
					<displayName>CR</displayName>
					<description>Control register</description>
					<addressOffset>0x08</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>CALIBSEL</name>
							<description>Self-calibration voltage selection</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CALIBEN</name>
							<description>Self-calibration enable</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TRGSHIFT</name>
							<description>External trigger shift sample</description>
							<bitOffset>19</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>TRGSELH</name>
							<description>External trigger selection high</description>
							<bitOffset>17</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>SCANDIR</name>
							<description>ADC scan direction</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CMPCH</name>
							<description>Window comparison channel selection</description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>ALIGN</name>
							<description>Data alignment</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MODE</name>
							<description>ADC mode</description>
							<bitOffset>9</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>ADST</name>
							<description>ADC start</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TRGSELL</name>
							<description>External trigger selection low</description>
							<bitOffset>4</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>DMAEN</name>
							<description>Direct memory access enable</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TRGEN</name>
							<description>External trigger enable</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ADWIE</name>
							<description>ADC window comparator interrupt enable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ADIE</name>
							<description>ADC interrupt enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CHSR</name>
					<displayName>CHSR</displayName>
					<description>Channel select register</description>
					<addressOffset>0x0c</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>CHVSEN</name>
							<description>Internal reference voltage channel enable</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CHTSEN</name>
							<description>Temperature Sensor channel enable</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CHCALIB</name>
							<description>Enable ADC internal self-calibration channel</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CH11EN</name>
							<description>Analog input channel 11 enable</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CH10EN</name>
							<description>Analog input channel 10 enable</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CH9EN</name>
							<description>Analog input channel 9 enable</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CH8EN</name>
							<description>Analog input channel 8 enable</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CH7EN</name>
							<description>Analog input channel 7 enable</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CH6EN</name>
							<description>Analog input channel 6 enable</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CH5EN</name>
							<description>Analog input channel 5 enable</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CH4EN</name>
							<description>Analog input channel 4 enable</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CH3EN</name>
							<description>Analog input channel 3 enable</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CH2EN</name>
							<description>Analog input channel 2 enable</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CH1EN</name>
							<description>Analog input channel 1 enable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CH0EN</name>
							<description>Analog input channel 0 enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CMPR</name>
					<displayName>CMPR</displayName>
					<description>Compare register</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>CMPHDATA</name>
							<description>Compare data high limit</description>
							<bitOffset>16</bitOffset>
							<bitWidth>12</bitWidth>
						</field>
						<field>
							<name>CMPLDATA</name>
							<description>Compare data low limit</description>
							<bitOffset>0</bitOffset>
							<bitWidth>12</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>SR</name>
					<displayName>SR</displayName>
					<description>Status register</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>OVERRUN</name>
							<description>Overrun flag</description>
							<bitOffset>20</bitOffset>
							<bitWidth>12</bitWidth>
						</field>
						<field>
							<name>VALID</name>
							<description>Valid flag</description>
							<bitOffset>8</bitOffset>
							<bitWidth>12</bitWidth>
						</field>
						<field>
							<name>CH</name>
							<description>Current conversion channel</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>BUSY</name>
							<description>Busy</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ADWIF</name>
							<description>ADC window comparator interrupt flag</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ADIF</name>
							<description>ADC interrupt flag</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CH0DR</name>
					<displayName>CH0DR</displayName>
					<description>Channel 0 data register</description>
					<addressOffset>0x18</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>VALID</name>
							<description>Valid flag</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OVERRUN</name>
							<description>Overrun flag</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DATA</name>
							<description>Transfer data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CH1DR</name>
					<displayName>CH1DR</displayName>
					<description>Channel 1 data register</description>
					<addressOffset>0x1c</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>VALID</name>
							<description>Valid flag</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OVERRUN</name>
							<description>Overrun flag</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DATA</name>
							<description>Transfer data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CH2DR</name>
					<displayName>CH2DR</displayName>
					<description>Channel 2 data register</description>
					<addressOffset>0x20</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>VALID</name>
							<description>Valid flag</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OVERRUN</name>
							<description>Overrun flag</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DATA</name>
							<description>Transfer data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CH3DR</name>
					<displayName>CH3DR</displayName>
					<description>Channel 3 data register</description>
					<addressOffset>0x24</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>VALID</name>
							<description>Valid flag</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OVERRUN</name>
							<description>Overrun flag</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DATA</name>
							<description>Transfer data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CH4DR</name>
					<displayName>CH4DR</displayName>
					<description>Channel 4 data register</description>
					<addressOffset>0x28</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>VALID</name>
							<description>Valid flag</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OVERRUN</name>
							<description>Overrun flag</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DATA</name>
							<description>Transfer data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CH5DR</name>
					<displayName>CH5DR</displayName>
					<description>Channel 5 data register</description>
					<addressOffset>0x2c</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>VALID</name>
							<description>Valid flag</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OVERRUN</name>
							<description>Overrun flag</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DATA</name>
							<description>Transfer data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CH6DR</name>
					<displayName>CH6DR</displayName>
					<description>Channel 6 data register</description>
					<addressOffset>0x30</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>VALID</name>
							<description>Valid flag</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OVERRUN</name>
							<description>Overrun flag</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DATA</name>
							<description>Transfer data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CH7DR</name>
					<displayName>CH7DR</displayName>
					<description>Channel 7 data register</description>
					<addressOffset>0x34</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>VALID</name>
							<description>Valid flag</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OVERRUN</name>
							<description>Overrun flag</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DATA</name>
							<description>Transfer data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CH8DR</name>
					<displayName>CH8DR</displayName>
					<description>Channel 8 data register</description>
					<addressOffset>0x38</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>VALID</name>
							<description>Valid flag</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OVERRUN</name>
							<description>Overrun flag</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DATA</name>
							<description>Transfer data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CH9DR</name>
					<displayName>CH9DR</displayName>
					<description>Channel 9 data register</description>
					<addressOffset>0x3C</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>VALID</name>
							<description>Valid flag</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OVERRUN</name>
							<description>Overrun flag</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DATA</name>
							<description>Transfer data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CH10DR</name>
					<displayName>CH10DR</displayName>
					<description>Channel 10 data register</description>
					<addressOffset>0x40</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>VALID</name>
							<description>Valid flag</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OVERRUN</name>
							<description>Overrun flag</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DATA</name>
							<description>Transfer data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CH11DR</name>
					<displayName>CH11DR</displayName>
					<description>Channel 11 data register</description>
					<addressOffset>0x44</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>VALID</name>
							<description>Valid flag</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OVERRUN</name>
							<description>Overrun flag</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DATA</name>
							<description>Transfer data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CH12DR</name>
					<displayName>CH12DR</displayName>
					<description>Channel 12 data register</description>
					<addressOffset>0x48</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>VALID</name>
							<description>Valid flag</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OVERRUN</name>
							<description>Overrun flag</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DATA</name>
							<description>Transfer data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CH14DR</name>
					<displayName>CH14DR</displayName>
					<description>Channel 14 data register</description>
					<addressOffset>0x50</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>VALID</name>
							<description>Valid flag</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OVERRUN</name>
							<description>Overrun flag</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DATA</name>
							<description>Transfer data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CH15DR</name>
					<displayName>CH15DR</displayName>
					<description>Channel 15 data register</description>
					<addressOffset>0x54</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>VALID</name>
							<description>Valid flag</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OVERRUN</name>
							<description>Overrun flag</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DATA</name>
							<description>Transfer data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
