Bastion-RND/Watering-embedded/src/Slave-device/SVD/MM32F031xxq.svd
				<register>
					<name>CPAR1</name>
					<displayName>CPAR1</displayName>
					<description>CPAR1</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<name>PA</name>
							<description>Peripheral address</description>
						</field>
					</fields>
				</register>
				<register>
					<name>CPAR2</name>
					<displayName>CPAR2</displayName>
					<description>CPAR2</description>
					<addressOffset>0x24</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<name>PA</name>
							<description>Peripheral address</description>
						</field>
					</fields>
				</register>
				<register>
					<name>CPAR3</name>
					<displayName>CPAR3</displayName>
					<description>CPAR3</description>
					<addressOffset>0x38</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<name>PA</name>
							<description>Peripheral address</description>
						</field>
					</fields>
				</register>
				<register>
					<name>CPAR4</name>
					<displayName>CPAR4</displayName>
					<description>CPAR4</description>
					<addressOffset>0x4c</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<name>PA</name>
							<description>Peripheral address</description>
						</field>
					</fields>
				</register>
				<register>
					<name>CPAR5</name>
					<displayName>CPAR5</displayName>
					<description>CPAR5</description>
					<addressOffset>0x60</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<name>PA</name>
							<description>Peripheral address</description>
						</field>
					</fields>
				</register>
				<register>
					<name>CMAR1</name>
					<displayName>CMAR1</displayName>
					<description>CMAR1</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<name>MA</name>
							<description>Memory address</description>
						</field>
					</fields>
				</register>
				<register>
					<name>CMAR2</name>
					<displayName>CMAR2</displayName>
					<description>CMAR2</description>
					<addressOffset>0x28</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<name>MA</name>
							<description>Memory address</description>
						</field>
					</fields>
				</register>
				<register>
					<name>CMAR3</name>
					<displayName>CMAR3</displayName>
					<description>CMAR3</description>
					<addressOffset>0x3c</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<name>MA</name>
							<description>Memory address</description>
						</field>
					</fields>
				</register>
				<register>
					<name>CMAR4</name>
					<displayName>CMAR4</displayName>
					<description>CMAR4</description>
					<addressOffset>0x50</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<name>MA</name>
							<description>Memory address</description>
						</field>
					</fields>
				</register>
				<register>
					<name>CMAR5</name>
					<displayName>CMAR5</displayName>
					<description>CMAR5</description>
					<addressOffset>0x64</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<name>MA</name>
							<description>Memory address</description>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>EXTI</name>
			<description>External interrupt/event controller</description>
			<groupName>EXTI</groupName>
			<baseAddress>0x40010000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x800</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>EXTI0_1</name>
				<description>EXTI Line0_1 interrupt</description>
				<value>5</value>
			</interrupt>
			<interrupt>
				<name>EXTI2_3</name>
				<description>EXTI Line2_3 interrupt</description>
				<value>6</value>
			</interrupt>
			<interrupt>
				<name>EXTI4_15</name>
				<description>EXTI Line4_15 interrupt</description>
				<value>7</value>
			</interrupt>
			<registers>
				<register>
					<name>CFGR</name>
					<displayName>CFGR</displayName>
					<description>Configuration register</description>
					<addressOffset>0x00</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>TIM17_DMA</name>
							<description>TIM17_DMA_RMP</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM16_DMA</name>
							<description>TIM16_DMA_RMP</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>UART1_RX_DMA</name>
							<description>UART1_RX_DMA_RMP</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>UART1_TX_DMA</name>
							<description>UART1_TX_DMA_RMP</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ADC_DMA</name>
							<description>ADC_DMA_RMP</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MEM_MODE</name>
							<description>MEM_MODE</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CR1</name>
					<displayName>CR1</displayName>
					<description>External interrupt configuration register 1</description>
					<addressOffset>0x08</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>EXTI3</name>
							<description>EXTI3 configuration</description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>EXTI2</name>
							<description>EXTI2 configuration</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>EXTI1</name>
							<description>EXTI1 configuration</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>EXTI0</name>
							<description>EXTI0 configuration</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CR2</name>
					<displayName>CR2</displayName>
					<description>External interrupt configuration register 2</description>
					<addressOffset>0x0C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>EXTI7</name>
							<description>EXTI7 configuration</description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>EXTI6</name>
							<description>EXTI6 configuration</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>EXTI5</name>
							<description>EXTI5 configuration</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>EXTI4</name>
							<description>EXTI4 configuration</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CR3</name>
					<displayName>CR3</displayName>
					<description>External interrupt configuration register 3</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>EXTI11</name>
							<description>EXTI11 configuration</description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>EXTI10</name>
							<description>EXTI10 configuration</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>EXTI9</name>
							<description>EXTI9 configuration</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>EXTI8</name>
							<description>EXTI8 configuration</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CR4</name>
					<displayName>CR4</displayName>
					<description>External interrupt configuration register 4</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>EXTI15</name>
							<description>EXTI15 configuration</description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>EXTI14</name>
							<description>EXTI14 configuration</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>EXTI13</name>
							<description>EXTI13 configuration</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>EXTI12</name>
							<description>EXTI12 configuration</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IMR</name>
					<displayName>IMR</displayName>
					<description>Interrupt mask register</description>
					<addressOffset>0x400</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>IMR24</name>
							<description>Interrupt Mask on line 24</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IMR19</name>
							<description>Interrupt Mask on line 19</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IMR16</name>
							<description>Interrupt Mask on line 16</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IMR15</name>
							<description>Interrupt Mask on line 15</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IMR14</name>
							<description>Interrupt Mask on line 14</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IMR13</name>
							<description>Interrupt Mask on line 13</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IMR12</name>
							<description>Interrupt Mask on line 12</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IMR11</name>
							<description>Interrupt Mask on line 11</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IMR10</name>
							<description>Interrupt Mask on line 10</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IMR9</name>
							<description>Interrupt Mask on line 9</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IMR8</name>
							<description>Interrupt Mask on line 8</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IMR7</name>
							<description>Interrupt Mask on line 7</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IMR6</name>
							<description>Interrupt Mask on line 6</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IMR5</name>
							<description>Interrupt Mask on line 5</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IMR4</name>
							<description>Interrupt Mask on line 4</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IMR3</name>
							<description>Interrupt Mask on line 3</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IMR2</name>
							<description>Interrupt Mask on line 2</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IMR1</name>
							<description>Interrupt Mask on line 1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IMR0</name>
							<description>Interrupt Mask on line 0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>EMR</name>
					<displayName>EMR</displayName>
					<description>Event mask register</description>
					<addressOffset>0x404</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>EMR24</name>
							<description>Event Mask on line 24</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EMR19</name>
							<description>Event Mask on line 19</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EMR16</name>
							<description>Event Mask on line 16</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EMR15</name>
							<description>Event Mask on line 15</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EMR14</name>
							<description>Event Mask on line 14</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EMR13</name>
							<description>Event Mask on line 13</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EMR12</name>
							<description>Event Mask on line 12</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EMR11</name>
							<description>Event Mask on line 11</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EMR10</name>
							<description>Event Mask on line 10</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EMR9</name>
							<description>Event Mask on line 9</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EMR8</name>
							<description>Event Mask on line 8</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EMR7</name>
							<description>Event Mask on line 7</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EMR6</name>
							<description>Event Mask on line 6</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EMR5</name>
							<description>Event Mask on line 5</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EMR4</name>
							<description>Event Mask on line 4</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EMR3</name>
							<description>Event Mask on line 3</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EMR2</name>
							<description>Event Mask on line 2</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EMR1</name>
							<description>Event Mask on line 1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EMR0</name>
							<description>Event Mask on line 0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RTSR</name>
					<displayName>RTSR</displayName>
					<description>Rising trigger selection register</description>
					<addressOffset>0x408</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>TR24</name>
							<description>Rising trigger event configuration bit of line 24</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TR19</name>
							<description>Rising trigger event configuration bit of line 19</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TR16</name>
							<description>Rising trigger event configuration bit of line 16</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TR15</name>
							<description>Rising trigger event configuration bit of line 15</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TR14</name>
							<description>Rising trigger event configuration bit of line 14</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TR13</name>
							<description>Rising trigger event configuration bit of line 13</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TR12</name>
							<description>Rising trigger event configuration bit of line 12</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TR11</name>
							<description>Rising trigger event configuration bit of line 11</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TR10</name>
							<description>Rising trigger event configuration bit of line 10</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TR9</name>
							<description>Rising trigger event configuration bit of line 9</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TR8</name>
							<description>Rising trigger event configuration bit of line 8</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TR7</name>
							<description>Rising trigger event configuration bit of line 7</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TR6</name>
							<description>Rising trigger event configuration bit of line 6</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TR5</name>
							<description>Rising trigger event configuration bit of line 5</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TR4</name>
							<description>Rising trigger event configuration bit of line 4</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TR3</name>
							<description>Rising trigger event configuration bit of line 3</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TR2</name>
							<description>Rising trigger event configuration bit of line 2</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TR1</name>
							<description>Rising trigger event configuration bit of line 1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TR0</name>
							<description>Rising trigger event configuration bit of line 0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
