Bastion-RND/Watering-embedded/src/Slave-device/SVD/MM32F031xxq.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>IWDG</name>
			<description>Independent watchdog</description>
			<groupName>IWDG</groupName>
			<baseAddress>0x40003000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>KR</name>
					<displayName>KR</displayName>
					<description>Key register</description>
					<addressOffset>0x00</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x000000000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<name>KEY</name>
							<description>Key value</description>
						</field>
					</fields>
				</register>
				<register>
					<name>PR</name>
					<displayName>PR</displayName>
					<description>Prescaler register</description>
					<addressOffset>0x04</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x000000000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<name>PR</name>
							<description>Prescaler divider</description>
						</field>
					</fields>
				</register>
				<register>
					<name>RLR</name>
					<displayName>RLR</displayName>
					<description>Reload register</description>
					<addressOffset>0x08</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000FFF</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>12</bitWidth>
							<name>RL</name>
							<description>Watchdog counter reload value</description>
						</field>
					</fields>
				</register>
				<register>
					<name>SR</name>
					<displayName>SR</displayName>
					<description>Status register</description>
					<addressOffset>0x0c</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x000000000</resetValue>
					<fields>
						<field>
							<name>RVU</name>
							<description>Watchdog counter reload value update</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PVU</name>
							<description>Watchdog prescaler value update</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CR</name>
					<displayName>CR</displayName>
					<description>Control register</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>IRQ_CLR</name>
							<description>Interruput clear</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IRQ_SEL</name>
							<description>Interruput select</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>PWR</name>
			<description>Power control</description>
			<groupName>PWR</groupName>
			<baseAddress>0x40007000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>PVD</name>
				<description>PVD through EXTI line detection interrupt</description>
				<value>1</value>
			</interrupt>
			<registers>
				<register>
					<name>CR</name>
					<displayName>CR</displayName>
					<description>CR</description>
					<addressOffset>0x00</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>PLS</name>
							<description>PVD level selection</description>
							<bitOffset>9</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>PVDE</name>
							<description>Power voltage detector enable</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CSBF</name>
							<description>Clear standby flag</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CWUF</name>
							<description>Clear wakeup flag</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PDDS</name>
							<description>Power down deepsleep</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LPDS</name>
							<description>Low power deepsleep</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CSR</name>
					<displayName>CSR</displayName>
					<description>CSR</description>
					<addressOffset>0x04</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>EWUP</name>
							<description>Enable WKUP pin</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PVDO</name>
							<description>PVD output</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SBF</name>
							<description>Standby flag</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>WUF</name>
							<description>Wakeup flag</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>RCC</name>
			<description>Reset and clock control</description>
			<groupName>RCC</groupName>
			<baseAddress>0x40021000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>RCC</name>
				<description>RCC global interrupt</description>
				<value>4</value>
			</interrupt>
			<registers>
				<register>
					<name>CR</name>
					<displayName>CR</displayName>
					<description>Control Register</description>
					<addressOffset>0x00</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000003</resetValue>
					<fields>
						<field>
							<name>STDBY_FS_WK</name>
							<description>Quickly wake-up standby mode selection</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HSI_72M</name>
							<description>HSI output 72M</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CCSON</name>
							<description>Clock security system enable</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HSEBYP</name>
							<description>External high-speed clock bypass</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HSERDY</name>
							<description>External high-speed clock ready flag</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HSEON</name>
							<description>External high-speed clock enable</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HSICAL</name>
							<description>Internal high-speed clock calibration</description>
							<bitOffset>8</bitOffset>
							<bitWidth>6</bitWidth>
						</field>
						<field>
							<name>HSITEN</name>
							<description>Internal high-speed clock temperature enable</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HSIRDY</name>
							<description>Internal high-speed clock ready flag</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HSION</name>
							<description>Internal high-speed clock enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CFGR</name>
					<displayName>CFGR</displayName>
					<description>Configuration Register</description>
					<addressOffset>0x04</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>MCO</name>
							<description>Microcontroller clock output</description>
							<bitOffset>24</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>PPRE2</name>
							<description>APB high-speed prescaler(APB2)</description>
							<bitOffset>11</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>PPRE1</name>
							<description>APB low-speed prescaler(APB1)</description>
							<bitOffset>8</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>HPRE</name>
							<description>AHB Prescaler</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>SWS</name>
							<description>System clock switch status</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>SW</name>
							<description>System clock switch</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CIR</name>
					<displayName>CIR</displayName>
					<description>Clock Interrupt Register</description>
					<addressOffset>0x08</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CSSC</name>
							<description>Clock security system interrupt clear</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HSERDYC</name>
							<description>HSE ready interrupt clear</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HSIRDYC</name>
							<description>HSI ready interrupt clear</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LSIRDYC</name>
							<description>LSI ready interrupt clear</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HSERDYIE</name>
							<description>HSE ready interrupt enable</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HSIRDYIE</name>
							<description>HSI ready interrupt enable</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LSIRDYIE</name>
							<description>LSI ready interrupt enable</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CSSF</name>
							<description>Clock security system interrupt flag</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HSERDYF</name>
							<description>HSE ready interrupt flag</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HSIRDYF</name>
							<description>HSI ready interrupt flag</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LSIRDYF</name>
							<description>LSI ready interrupt flag</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>APB2RSTR</name>
					<displayName>APB2RSTR</displayName>
					<description>Advanced Peripheral Bus 2 Reset Register</description>
					<addressOffset>0x0C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PWM</name>
							<description>PWM reset</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DBGMCU</name>
							<description>DBGMCU reset</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM17</name>
							<description>TIM17 reset</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM16</name>
							<description>TIM16 reset</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM14</name>
							<description>TIM14 reset</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>COMP</name>
							<description>COMP interface reset</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>UART1</name>
							<description>UART1 reset</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SPI1</name>
							<description>SPI1 reset</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM1</name>
							<description>TIM1 reset</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ADC1</name>
							<description>ADC1 interface reset</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EXTI</name>
							<description>External Interrupt</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>APB1RSTR</name>
					<displayName>APB1RSTR</displayName>
					<description>Advanced Peripheral Bus 1 Reset Register</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PWR</name>
							<description>Power interface reset</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>I2C1</name>
							<description>I2C1 reset</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>UART2</name>
							<description>UART2 reset</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SPI2</name>
							<description>SPI2 reset</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>WWDG</name>
							<description>Window watchdog reset</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM3</name>
							<description>TIM3 reset</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM2</name>
							<description>TIM2 reset</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>AHBENR</name>
					<displayName>AHBENR</displayName>
					<description>Advanced High Performance Bus Enable Register</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000014</resetValue>
					<fields>
						<field>
							<name>HWDIV</name>
							<description>HWDIV clock enable</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GPIOD</name>
							<description>I/O port D clock enable</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GPIOC</name>
							<description>I/O port C clock enable</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GPIOB</name>
							<description>I/O port B clock enable</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GPIOA</name>
							<description>I/O port A clock enable</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CRC</name>
							<description>CRC clock enable</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FLITF</name>
							<description>FLITF clock enable</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SRAM</name>
							<description>SRAM interface clock enable</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DMA1</name>
							<description>DMA1 clock enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>APB2ENR</name>
					<displayName>APB2ENR</displayName>
					<description>Advanced Peripheral Bus 2 Enable Register</description>
					<addressOffset>0x18</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PWM</name>
							<description>*D23</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DBGMCU</name>
							<description>DBGMCU enable</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM17</name>
							<description>TIM17 enable</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM16</name>
							<description>TIM16 enable</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM14</name>
							<description>TIM14 enable</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>COMP</name>
							<description>COMP interface enable</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>UART1</name>
							<description>UART1 enable</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SPI1</name>
							<description>SPI1 enable</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM1</name>
							<description>TIM1 enable</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ADC1</name>
							<description>ADC1 interface enable</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EXTI</name>
							<description>External Interrupt</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>APB1ENR</name>
					<displayName>APB1ENR</displayName>
					<description>Advanced Peripheral Bus 1 Enable Register</description>
					<addressOffset>0x1C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PWR</name>
							<description>Power interface clock enable</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>I2C1</name>
							<description>I2C1 clock enable</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>UART2</name>
							<description>UART2 clock enable</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SPI2</name>
							<description>SPI2 clock enable</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>WWDG</name>
							<description>Window watchdog clock enable</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM3</name>
							<description>TIM3 clock enable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM2</name>
							<description>TIM2 clock enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CSR</name>
					<displayName>CSR</displayName>
					<description>Control Status Register</description>
					<addressOffset>0x24</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0C000000</resetValue>
					<fields>
						<field>
							<name>WWDGRSTF</name>
							<description>Window watchdog reset flag</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IWDGRSTF</name>
							<description>Independent watchdog reset flag</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SFTRSTF</name>
							<description>Software reset flag</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PORRSTF</name>
							<description>POR/PDR reset flag</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PINRSTF</name>
							<description>PIN reset flag</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RMVF</name>
							<description>Remove reset flag</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LSIRDY</name>
							<description>Internal low-speed oscillator ready</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LSION</name>
							<description>Internal low-speed oscillator enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
